   # CS3315 Introduction to Machine Learning and Big Data

   ### Prof. Barton

   # Lab 1

### Default of Credit Card Clients.

The data set "credit_card_default.csv" consists of several features that describe customer's credit information. The last column called "default payment next month" is a binary label indicating if a customer will default (Yes = 1, No = 0) on their credit card payment. The features may be used to predict if a customer will default or not default next month. Below is a description of the features:

X1: Amount of the given credit (NT dollar): it includes both the individual consumer credit and his/her family (supplementary) credit.

X2: Gender (MALE; FEMALE).

X3: Education (GRADUATE SCHOOL; UNIVERSITY; HIGH SCHOOL; OTHER).

X4: Marital status (1 = married; 2 = single; 3 = others).

X5: Age (year).

X6 - X11: History of past payment. We tracked the past monthly payment records (from April to September, 2005) as follows: X6 = the repayment status in September, 2005; X7 = the repayment status in August, 2005; . . .;X11 = the repayment status in April, 2005. The measurement scale for the repayment status is: -1 = pay duly; 1 = payment delay for one month; 2 = payment delay for two months; . . .; 8 = payment delay for eight months; 9 = payment delay for nine months and above.

X12-X17: Amount of bill statement (NT dollar). X12 = amount of bill statement in September, 2005; X13 = amount of bill statement in August, 2005; . . .; X17 = amount of bill statement in April, 2005.

X18-X23: Amount of previous payment (NT dollar). X18 = amount paid in September, 2005; X19 = amount paid in August, 2005; . . .;X23 = amount paid in April, 2005.


### Please complete the exercises below.

## Exercise 1
a. Load the data set 'credit_card_default.csv' into a Pandas DataFrame. Execute the following functions on the DataFrame and print the results: 1) head(), 2) info(), 3) describe(), 4) isnull().sum(). 

b. Set the 'ID' column to be the new row index using the set_index() function.

##Imports

In [11]:
import pandas as pd

In [12]:
#read in the data from the csv file
df = pd.read_csv('credit_card_default.csv')

In [13]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,FEMALE,UNIVERSITY,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,FEMALE,UNIVERSITY,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,FEMALE,UNIVERSITY,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,FEMALE,UNIVERSITY,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,MALE,UNIVERSITY,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29655 entries, 0 to 29654
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          29655 non-null  int64
 1   LIMIT_BAL                   29655 non-null  int64
 2   SEX                         29655 non-null  object
 3   EDUCATION                   29655 non-null  object
 4   MARRIAGE                    29655 non-null  int64
 5   AGE                         29655 non-null  int64
 6   PAY_0                       29655 non-null  int64
 7   PAY_2                       29655 non-null  int64
 8   PAY_3                       29655 non-null  int64
 9   PAY_4                       29655 non-null  int64
 10  PAY_5                       29655 non-null  int64
 11  PAY_6                       29655 non-null  int64
 12  BILL_AMT1                   29655 non-null  int64
 13  BILL_AMT2                   29655 non-null  int64
 14  BILL_AMT3                   29655 non-null  int64
 15  BILL_AMT4                   29655 non-null  int64
 16  BILL_AMT5                   29655 non-null  int64
 17  BILL_AMT6                   29655 non-null  int64
 18  PAY_AMT1                    29655 non-null  int64
 19  PAY_AMT2                    29655 non-null  int64
 20  PAY_AMT3                    29655 non-null  int64
 21  PAY_AMT4                    29655 non-null  int64
 22  PAY_AMT5                    29655 non-null  int64
 23  PAY_AMT6                    29655 non-null  int64
 24  default payment next month  29655 non-null  int64
dtypes: int64(23), object(2)
memory usage: 5.7+ MB

In [15]:
df.describe()

,ID,LIMIT_BAL,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,29655.000000,29655.000000,29655.000000,29655.000000,29655.000000,29655.000000,29655.000000,29655.000000,29655.000000,29655.000000,...,29655.000000,29655.000000,29655.000000,29655.000000,2.965500e+04,29655.000000,29655.000000,29655.000000,29655.000000,29655.000000
mean,14973.186613,167487.562974,1.552622,35.468353,-0.015208,-0.131445,-0.163514,-0.218580,-0.264239,-0.287810,...,43078.641612,40194.544259,38818.310774,5653.467240,5.889120e+03,5196.284539,4825.082145,4790.169887,5175.967459,0.222897
std,8661.024648,129882.968233,0.521851,9.212746,1.124840,1.199858,1.200230,1.172473,1.136372,1.152419,...,64153.942066,60660.052976,59481.439973,16578.990615,2.306958e+04,17569.349748,15699.258348,15231.767342,17643.276470,0.416197
min,1.000000,10000.000000,0.000000,21.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,...,-170000.000000,-81334.000000,-339603.000000,0.000000,0.000000e+00,0.000000,0.000000,0.000000,0.000000,0.000000
25%,7475.500000,50000.000000,1.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,...,2318.500000,1773.500000,1270.000000,1000.000000,8.205000e+02,390.000000,296.000000,258.000000,133.000000,0.000000
50%,14956.000000,140000.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,19000.000000,18077.000000,17102.000000,2100.000000,2.006000e+03,1800.000000,1500.000000,1500.000000,1500.000000,0.000000
75%,22467.500000,240000.000000,2.000000,41.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,54063.500000,50030.000000,49097.500000,5005.000000,5.000000e+03,4500.000000,4012.500000,4034.500000,4000.000000,0.000000
max,30000.000000,1000000.000000,3.000000,79.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,...,891586.000000,927171.000000,961664.000000,873552.000000,1.684259e+06,896040.000000,621000.000000,426529.000000,528666.000000,1.000000

In [16]:
df.isnull().sum()

ID                            0
LIMIT_BAL                     0
SEX                           0
EDUCATION                     0
MARRIAGE                      0
AGE                           0
PAY_0                         0
PAY_2                         0
PAY_3                         0
PAY_4                         0
PAY_5                         0
PAY_6                         0
BILL_AMT1                     0
BILL_AMT2                     0
BILL_AMT3                     0
BILL_AMT4                     0
BILL_AMT5                     0
BILL_AMT6                     0
PAY_AMT1                      0
PAY_AMT2                      0
PAY_AMT3                      0
PAY_AMT4                      0
PAY_AMT5                      0
PAY_AMT6                      0
default payment next month    0
dtype: int64

In [21]:
#change the ID row to be the index
df = df.set_index('ID')

#verify
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
ID,,,,,,,,,,,,,,,,,,,,,
1,20000,FEMALE,UNIVERSITY,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,1
2,120000,FEMALE,UNIVERSITY,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,90000,FEMALE,UNIVERSITY,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,50000,FEMALE,UNIVERSITY,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
5,50000,MALE,UNIVERSITY,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

## Exercise 2

a. Plot a histogram matrix using the hist() function. In your own words, please describe some insights about the data that you notice form the histograms.

b. Print the correlation coefficients using the corr() funtion. Which features have a positive correlation? In your own words, please describe why those featuers may have a positive correlation.

c. Plot a scatter matrix using the following attributes: "PAY_0", "PAY_2", "PAY_3", "LIMIT_BAL","default payment next month".

## Exercise 3

a. The 'SEX' column contans values 'MALE' and 'FEMALE'. Write a custom ordinal encoder function that encodes 'MALE' to 0 and 'FEMALE' to 1. Apply the function to the 'SEX' column.

b. The 'EDUCATION' column contains values 'GRADUATE SCHOOL', 'UNIVERSITY', 'HIGH SCHOOL', and 'OTHER'. Write a one hot encoder function and apply it to the 'EDUCATION' column. After this you should have four new binary columns, one for each category.

c. Drop the previous 'EDUCATION' column from the DataFrame.


### Please run the code block below to split the data into X (feature vectors), and y (labels).

In [ ]:
X = df.drop(['default payment next month'],axis=1)
y = df[['default payment next month']]

### Please run the code block below to apply feature scaling to the feature vectors X.

In [ ]:
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler


pipeline = Pipeline([
    ('std_scaler', StandardScaler())
    
])

df_scaled = pipeline.fit_transform(X)
X = pd.DataFrame(df_scaled)
#df.head()

**Please Run the code blocks below** to split the data into train and test sets, and to train the classifier.  Note, the following code expects **feature vectors X** and **labels y** as arguments.

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
sgd_clf = KNeighborsClassifier(n_neighbors=11)
sgd_clf.fit(X_train, y_train)

y_pred = sgd_clf.predict(X_test)

## Exercise 5

a. Calculate accuracy.

b. Calculate precision.

c. Calculate recall.

d. Calculate F1 score.

e. Which error is higher in the model, false positives or false negatives? If a credit card company uses this classifer to decide whether or not to approve customers, which error may be more costly to the credit card company and why?